Autodesk.Revit.DB.Macros.MacroManager.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Macros.MacroManager.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.Macros.MacroManager.CheckModuleName(System.String,Autodesk.Revit.DB.Macros.MacroLanguageType)
Identifies if the module name is valid and do not duplicated with the existing one.
name:
The module name.
langugae:
The Macro language type.
Returns:
Returns the status of given module name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetMacroManager(Autodesk.Revit.ApplicationServices.Application)
Gets the Macro manager from the application.
application:
The application.
Returns:
The new Macro manager object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetApplicationMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application)
Gets the application macro security options.
application:
The application.
Returns:
Returns the application macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.SetApplicationMacroSecurityOptions(Autodesk.Revit.ApplicationServices.Application,Autodesk.Revit.DB.Macros.ApplicationMacroOptions)
Sets the application macro security options.
application:
The application.
macroOptions:
The application macro security options.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.GetMacroManagerIterator
Returns a Macro manager iterator that iterates through the collection.
Returns:
A Macro manager iterator object that can be used to iterate through key-value pairs in the collection.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.Contains(Autodesk.Revit.DB.Macros.MacroModule)
Indicates the given module is a member of this collection.
module:
The module.
Returns:
Returns true if the given module is a member of this collection, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.RemoveModule(Autodesk.Revit.DB.Macros.MacroModule)
Removes a MacroModule.
module:
The module will be removed.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given module is not a member of this collection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the given module is a UI module.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.AddModule(Autodesk.Revit.DB.Macros.ModuleSettings,Autodesk.Revit.DB.Macros.IModuleMaker)
Adds a MacroModule to the application.
moduleSettings:
The module settings.
maker:
The interface to create module project.
Returns:
The new module.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the module name is duplicated with the existing one,
or the name is too long, or the name contains invalid identifier(s),
such as include "#", "%", ... and key words in C#.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Macros.MacroManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.Count
The count.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.Folder
The modules folder.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.IsEditEnabled
Indicates if the module can be edit.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager.IsEnabled
Indicates if macros stored in this MacroManager are enabled.
Since:
2014

Autodesk.Revit.DB.Macros.MacroManager
Manager object for the Macro modules of the application.
Since:
2014